namespace WebApi.Data
{
    public static class DictionaryNames
    {
        public static readonly string[] NameWomanArr = new[]
{
            "Светлана",
            "Ксения",
            "Александра",
            "Мария",
            "Лариса",
            "Ангелина",
            "Анжела",
            "Лидия",
            "Алла",
            "Татьяна",
            "София",
        };

        public static readonly Dictionary<string, string[]> NameManArr = new Dictionary<string, string[]>
        {
            { "Дмитрий", new[] { "Дмитриевич", "Дмитриевна" } },
            { "Максим", new[] { "Максимович", "Максимовна" } },
            { "Петр", new[] { "Петрович", "Петровна" } },
            { "Василий", new[] { "Васильевич", "Васильевна" } },
            { "Сергей", new[] { "Сергеевич", "Сергеевна" } },
            { "Матвей", new[] { "Матвеевич", "Матвеевна" } },
            { "Николай", new[] { "Николаевич", "Николаевна" } },
            { "Михаил", new[] { "Михайлович", "Михайловна" } },
            { "Андрей", new[] { "Андреевич", "Андреевна" } },
            { "Арсений", new[] { "Арсеньевич", "Арсеньевна" } },
            { "Леонид", new[] { "Леонидович", "Леонидовна" } },
            { "Алексей", new[] { "Алексеевич", "Алексеевна" } },
            { "Лев", new[] { "Львович", "Львовна" } },
            { "Константин", new[] { "Константинович", "Константиновна" } },
            { "Владимир", new[] { "Владимирович", "Владимировна" } },
        };

        public static readonly Dictionary<string, string> LastNames = new Dictionary<string, string>
        {
            { "Тепляков", "Теплякова" },
            { "Огурцов","Огурцова"},
            { "Климов","Климова"},
            { "Морозов","Морозова"},
            { "Петров","Петрова"},
            { "Иванов","Иванова"},
            { "Васильев","Васильева"},
            { "Соколов","Соколова"},
            { "Михеев","Михеева"},
            { "Левченко","Левченко"},
            { "Ковалев","Ковалева"},
            { "Кузнецов","Кузнецова"},
            { "Борисов", "Борисова"},
            { "Николаев", "Николаева" },
            { "Карпов", "Карпова"},
            { "Окунев", "Окунева"},
            { "Баклажанов", "Баклажанова"},
            { "Кабачков", "Кабачкова"},
            { "Салоедов", "Салоедова"},
            { "Сосисочкин", "Сосисочкина"}
        };
    }
}
